CSI API ETABS v1
cPropFrame.SetRebarBeam Method
 Assigns beam rebar data to frame sections.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetRebarBeam(
	string Name,
	string MatPropLong,
	string MatPropConfine,
	double CoverTop,
	double CoverBot,
	double TopLeftArea,
	double TopRightArea,
	double BotLeftArea,
	double BotRightArea
)
Function SetRebarBeam (
	Name As String,
	MatPropLong As String,
	MatPropConfine As String,
	CoverTop As Double,
	CoverBot As Double,
	TopLeftArea As Double,
	TopRightArea As Double,
	BotLeftArea As Double,
	BotRightArea As Double
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatPropLong As String
Dim MatPropConfine As String
Dim CoverTop As Double
Dim CoverBot As Double
Dim TopLeftArea As Double
Dim TopRightArea As Double
Dim BotLeftArea As Double
Dim BotRightArea As Double
Dim returnValue As Integer
returnValue = instance.SetRebarBeam(Name,
	MatPropLong, MatPropConfine, CoverTop,
	CoverBot, TopLeftArea, TopRightArea,
	BotLeftArea, BotRightArea)
int SetRebarBeam(
	String^ Name,
	String^ MatPropLong,
	String^ MatPropConfine,
	double CoverTop,
	double CoverBot,
	double TopLeftArea,
	double TopRightArea,
	double BotLeftArea,
	double BotRightArea
)
abstract SetRebarBeam :
        Name : string *
        MatPropLong : string *
        MatPropConfine : string *
        CoverTop : float *
        CoverBot : float *
        TopLeftArea : float *
        TopRightArea : float *
        BotLeftArea : float *
        BotRightArea : float -> int
Parameters
Name
Type: System.String
The name of an existing frame section property.
MatPropLong
Type: System.String
The name of the rebar material property for the longitudinal rebar.
MatPropConfine
Type: System.String
The name of the rebar material property for the confinement rebar.
CoverTop
Type: System.Double
The distance from the top of the beam to the centroid of the top longitudinal reinforcement. [L]
CoverBot
Type: System.Double
The distance from the bottom of the beam to the centroid of the bottom longitudinal reinforcement. [L]
TopLeftArea
Type: System.Double
The total area of longitudinal reinforcement at the top left end of the beam. [L2]
TopRightArea
Type: System.Double
The total area of longitudinal reinforcement at the top right end of the beam. [L2]
BotLeftArea
Type: System.Double
The total area of longitudinal reinforcement at the bottom left end of the beam. [L2]
BotRightArea
Type: System.Double
The total area of longitudinal reinforcement at the bottom right end of the beam. [L2]
Return Value
Type: Int32
Returns zero if the rebar data is successfully assigned; otherwise it returns a nonzero value.
Remarks
 This function applies only to the following section types. Calling this function for any other type of frame section property returns an error.
I
Angle
Rectangular
Circle
The material assigned to the specified frame section property must be concrete or this function returns an error.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim RebarName As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new frame section property
       ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
   'add ASTM A706 rebar material
       ret = SapModel.PropMaterial.AddQuick(RebarName, eMatType.Rebar, , , , , eMatTypeRebar.ASTM_A706)
   'set beam rebar data
       ret = SapModel.PropFrame.SetRebarBeam("R1", RebarName, RebarName, 3.5, 3, 4.1, 4.2, 4.3, 4.4)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace